# Pandas 1

In [84]:
import pandas as pd
import numpy as np

### Creare una serie
Proviamo a creare una serie pandas utilizzando dei numeri casuali generati con la libreria numpy. <br>
Utilizziamo la proprietà random, con cui è possibile generare numeri pseudocasuali: specificando il medesimo seed è possibile generare sempre gli stessi numeri pseudocasuali (in questo caso utilizziamo sempre "1" come seed).

In [85]:
np.random.seed(1)
s = pd.Series(np.random.randn(100))

In [86]:
s.head(21) # restituisce i primi 21 valori della serie (da 0 a 20)

0     1.624345
1    -0.611756
2    -0.528172
3    -1.072969
4     0.865408
5    -2.301539
6     1.744812
7    -0.761207
8     0.319039
9    -0.249370
10    1.462108
11   -2.060141
12   -0.322417
13   -0.384054
14    1.133769
15   -1.099891
16   -0.172428
17   -0.877858
18    0.042214
19    0.582815
20   -1.100619
dtype: float64

In [87]:
s[2] # restituisce il terzo elemento della serie (le serie sono indicizzate a partire da 0)

-0.5281717522634557

In [88]:
s[[2,5,20]] # è possibile passare tra le quadre un array di posizioni per far restituire soltanto le posizioni di interesse

2    -0.528172
5    -2.301539
20   -1.100619
dtype: float64

In [89]:
s[3:8] # restituisce gli elementi compresi tra le posizioni specificate (estremo finale escluso)

3   -1.072969
4    0.865408
5   -2.301539
6    1.744812
7   -0.761207
dtype: float64

In [90]:
s.tail(10) # restituisce gli ultimi 10 elementi della serie

90    1.198918
91    0.185156
92   -0.375285
93   -0.638730
94    0.423494
95    0.077340
96   -0.343854
97    0.043597
98   -0.620001
99    0.698032
dtype: float64

In [91]:
s.index # proprietà che permette di conoscere come la serie è indicizzata

RangeIndex(start=0, stop=100, step=1)

In [92]:
s.values # proprietà che elenca i valori della serie in un array

array([ 1.62434536, -0.61175641, -0.52817175, -1.07296862,  0.86540763,
       -2.3015387 ,  1.74481176, -0.7612069 ,  0.3190391 , -0.24937038,
        1.46210794, -2.06014071, -0.3224172 , -0.38405435,  1.13376944,
       -1.09989127, -0.17242821, -0.87785842,  0.04221375,  0.58281521,
       -1.10061918,  1.14472371,  0.90159072,  0.50249434,  0.90085595,
       -0.68372786, -0.12289023, -0.93576943, -0.26788808,  0.53035547,
       -0.69166075, -0.39675353, -0.6871727 , -0.84520564, -0.67124613,
       -0.0126646 , -1.11731035,  0.2344157 ,  1.65980218,  0.74204416,
       -0.19183555, -0.88762896, -0.74715829,  1.6924546 ,  0.05080775,
       -0.63699565,  0.19091548,  2.10025514,  0.12015895,  0.61720311,
        0.30017032, -0.35224985, -1.1425182 , -0.34934272, -0.20889423,
        0.58662319,  0.83898341,  0.93110208,  0.28558733,  0.88514116,
       -0.75439794,  1.25286816,  0.51292982, -0.29809284,  0.48851815,
       -0.07557171,  1.13162939,  1.51981682,  2.18557541, -1.39649634,
       -1.44411381, -0.50446586,  0.16003707,  0.87616892,  0.31563495,
       -2.02220122, -0.30620401,  0.82797464,  0.23009474,  0.76201118,
       -0.22232814, -0.20075807,  0.18656139,  0.41005165,  0.19829972,
        0.11900865, -0.67066229,  0.37756379,  0.12182127,  1.12948391,
        1.19891788,  0.18515642, -0.37528495, -0.63873041,  0.42349435,
        0.07734007, -0.34385368,  0.04359686, -0.62000084,  0.69803203])

È possibile decidiere di indicizzare una serie in maniera diversa da quella default

In [93]:
s2 = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'd'])
s2

a    1
b    2
c    3
d    4
dtype: int64

Anche a partire da un dizionario chiave:valore può essere creata una serie, in cui la chiave di ciascun elemento del dizionario corrisponderà all'indice di tale elemento nella serie

In [94]:

s3 = pd.Series({'a':1, 'b':2, 'c':3, 'd':4})

Il numero di elementi di una serie può essere determinato utilizzando la funzione `len()`.

In [95]:
s = pd.Series([10,0,1,1,2,3,4,5,6,np.nan])
s

0    10.0
1     0.0
2     1.0
3     1.0
4     2.0
5     3.0
6     4.0
7     5.0
8     6.0
9     NaN
dtype: float64

In [96]:
len(s)

10

Un altro modo per determinare la dimensione di una serie è utilizzare la proprietà `shape` che restituisce una tupla con le dimensioni, numero righe e numero colonne.<br>
Nel caso di una serie avente una sola dimensione, si ottiene una tupla contenente un solo valore.

In [97]:
s.shape

(10,)

Nella serie di esempio abbiamo un valore che non è un numero (np.nan): per contare solo i valori numerici si utilizza il metodo `count()`.

In [98]:
s.count()

9

Per conoscere invece i valori unici di una serie si utilizza il metodo `unique()`.

In [99]:
s.unique()

array([10.,  0.,  1.,  2.,  3.,  4.,  5.,  6., nan])

E per contare invece il numero di volte in cui appaiono tali valori unici nella serie si usa il metodo `value_counts()`, il quale restituisce i valori già ordinati in ordine decrescente.

In [100]:
s.value_counts()

1.0     2
10.0    1
0.0     1
2.0     1
3.0     1
4.0     1
5.0     1
6.0     1
Name: count, dtype: int64

__NB__: una differenza fondamentale fra gli array di Numpy e le serie di Pandas è che le serie sono in grado di effettuare l'allineamento automatico sulla base dell'etichette poste come indici; questo significa che gli elementi appartenenti a due diverse serie vengono fatti corrispondere sulla base dell'etichetta, non sulla base della sola posizione come invece avviene negli array Numpy.

In [101]:
s3 = pd.Series([1,2,3,4], index = ['a','b','c','d'])

In [102]:
s3

a    1
b    2
c    3
d    4
dtype: int64

In [103]:
s4 = pd.Series([4,3,2,1], index = ['d','c','b','a'])
s4

d    4
c    3
b    2
a    1
dtype: int64

Avendo gli stessi indici è possibile sommare le due serie, ottenendo una nuova serie contenente in ciascun elemento la somma degli elementi delle due serie sommate. <br>
__NB__: nonostante le etichette siano state assegnate agli indici in un ordine differente nelle due serie, la somma avviene comunque facendo combaciare tali etichette.

In [104]:
s3 + s4

a    2
b    4
c    6
d    8
dtype: int64

Negli array Numpy invece, l'operazione viene effettuata solo sulla base della posizione: sommare due array significa quindi ottenere un nuovo array dove ciascun elemento è dato dalla somma degli elementi posti in nella medesima posizione nei due array.

In [105]:
np3 = np.array([1,2,3,4])
np4 = np.array([4,3,2,1])

In [106]:
np3 + np4

array([5, 5, 5, 5])

### Creare un dataframe

Un DataFrame può essere creato combinando diversi array Numpy.

In [107]:
pd.DataFrame(np.array([[10,11],[20,21],[30,31]]))

    0   1
0  10  11
1  20  21
2  30  31

Se non si specificano i valori degli indici e i nomi delle colonne, Pandas utilizza numeri interi.

Un DataFrame può anche essere creato combinando diverse serie Pandas.

In [108]:
df1 = pd.DataFrame([pd.Series(np.arange(10,15)),
                   pd.Series(np.arange(15,20))])
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

Per conoscere le dimensioni di un DataFrame è possibile nuovamente fare uso della proprietà `shape`. <br>
__NB__: un DataFrame ha solo due dimensioni, quindi `shape` restituisce sempre una tupla del tipo (numero_righe, numero_colonne).

In [109]:
df1.shape

(2, 5)

Per associare un nome alle colonne si fa uso del parametro `columns`.

In [110]:
df = pd.DataFrame(np.array([[10,11],[20,21],[30,31]]), columns = ['a','b'])
df

    a   b
0  10  11
1  20  21
2  30  31

E per conoscere il nome delle colonne di un DataFrame si usa l'omonima proprietà.

In [111]:
df.columns

Index(['a', 'b'], dtype='object')

__NB__: è possibile sovrascrivere i nomi delle colonne di un DataFrame assegnando i nuovi nomi alla sua proprietà `columns`.

In [112]:
df.columns = ['c1', 'c2']
df

   c1  c2
0  10  11
1  20  21
2  30  31

__NB__: vale lo stesso identico discorso per le righe, questa volta usando la proprietà `index`.

In [113]:
df.index = ['r1', 'r2', 'r3']
df

    c1  c2
r1  10  11
r2  20  21
r3  30  31

La proprietà `index` serve anche per conoscere i nomi degli indici del DataFrame.

In [114]:
df.index

Index(['r1', 'r2', 'r3'], dtype='object')

### Esempi

Creiamo un DataFrame partendo da un file csv che contiene dati sulle 500 società che costituiscono l'indice della borsa americana Standard & Poors 500.<br>
Con il parametro `index_col` specifichiamo quale colonna del file csv dovrà rappresentare l'indice del DataFrame che stiamo creando: in questo caso scegliamo la colonna "Symbol", che contiene i tickers dei titoli.

In [115]:
sp500 = pd.read_csv("sp500.csv", index_col='Symbol')

In [116]:
sp500.shape # dimensioni del dataframe: 500 righe e 14 colonne

(500, 14)

In [117]:
sp500.index # indici del dataframe, ovvero i tickers dei titoli

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [118]:
sp500.columns

Index(['Name', 'Sector', 'Price', 'Dividend Yield', 'Price/Earnings',
       'Earnings/Share', 'Book Value', '52 week low', '52 week high',
       'Market Cap', 'EBITDA', 'Price/Sales', 'Price/Book', 'SEC Filings'],
      dtype='object')

Per ora ci interessano solo alcune colonne: per filtrarle possiamo agire in due modi. <br>
Il primo modo è leggere il file csv indicando quali colonne ci interessano con il parametro `usecols`.

In [119]:
sp500_1 = pd.read_csv("sp500.csv", index_col='Symbol', usecols = [0, 2, 3])

In [120]:
sp500_1.head(10)

                        Sector   Price
Symbol
MMM                Industrials  141.14
ABT                Health Care   39.60
ABBV               Health Care   53.95
ACN     Information Technology   79.79
ACE                 Financials  102.91
ACT                Health Care  213.77
ADBE    Information Technology   64.30
AES                  Utilities   13.61
AET                Health Care   76.39
AFL                 Financials   61.31

Il secondo modo è passare una lista di colonne al DataFrame e farci restituire il DataFrame composto dalle sole colonne di nostro interesse.

In [121]:
sp500_2 = sp500[['Sector','Price','Book Value']]

In [122]:
sp500_2.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

Possiamo anche usare la proprietà `iloc` che consente di specificare quali righe e colonne si vuole selezionare all'interno del DataFrame: nel nostro caso vogliamo selezionare tutte le righe (e specifichiamo `:` alla proprietà proprio per dire questo) e vogliamo selezionare le sole colonne nelle posizioni 1, 2 e 6.

In [123]:
sp500_3 = sp500.iloc[:,[1,2,6]] # la sintassi è iloc[righe, colonne]

In [124]:
sp500_3

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

__NB__: i DataFrame creati fino a questo momento non sono nuovi DataFrame, ma sono soltanto viste che fanno riferimento a quello originale; per creare effettivamente un nuovo DataFrame occorre invocare il metodo `copy()`.

In [125]:
sp500_4 = sp500.iloc[:,[1,2,6]].copy()

Le colonne di un DataFrame di Pandas altro non sono che delle serie, motivo per cui è possibile estrapolare una serie a partire da una colonna di un DataFrame (questo però è possibile soltanto se il nome della colonna è privo di spazi).

In [126]:
sp500.Price

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

In [127]:
sp500.BookValue # errore, perché il nome della colonna è Book Value (con lo spazio)

AttributeError: 'DataFrame' object has no attribute 'BookValue'

### Selezionare righe in un DataFrame

Per selezionare determinate righe in un DataFrame ci sono tre modi:
- individuare una fetta di DataFrame ("slicing") con []
- cercare gli elementi sulla base dell'etichetta o del numero indice con gli operatori `loc` e `iloc`
- ricerca scalare con gli operatori `at` e `iat`

L'utilizzo dell'operatore [] va bene per selezionare elementi di una serie, tuttavia è sconsigliato (fatto salvo per casi particolari) per selezionare righe di un DataFrame.

Selezione delle prime tre righe utilizzando l'operatore []:

In [128]:
sp500_1[:3] # la sintassi è [start:end] dove l'indice di inizio è omesso in questo caso (di default si parte da indice 0)

             Sector   Price
Symbol
MMM     Industrials  141.14
ABT     Health Care   39.60
ABBV    Health Care   53.95

Selezione delle righe che vanno da XYL a YUM utilizzando l'operatore []:

In [129]:
sp500_1['XYL':'YUM']

                        Sector  Price
Symbol
XYL                Industrials  38.42
YHOO    Information Technology  35.02
YUM     Consumer Discretionary  74.77

Selezione utilizzando `loc[]` e `iloc[]`:
- `loc` basa la selezione sull'etichetta 
- `iloc` basa la selezione sull'indice (di posizione)

In [130]:
sp500_1.loc['MMM']

Sector    Industrials
Price          141.14
Name: MMM, dtype: object

In [131]:
sp500_1.loc[['MMM','MSFT']]

                        Sector   Price
Symbol
MMM                Industrials  141.14
MSFT    Information Technology   40.12

__NB__: scrivendo ad esempio `sp500_1.loc[3]` si sta chiedendo di selezionare la riga avente come _etichetta_ 3, non la riga in _posizione_ 3.

In [132]:
sp500_1.iloc[[0,5]]

             Sector   Price
Symbol
MMM     Industrials  141.14
ACT     Health Care  213.77

In [133]:
sp500_1.iloc[0:5]

                        Sector   Price
Symbol
MMM                Industrials  141.14
ABT                Health Care   39.60
ABBV               Health Care   53.95
ACN     Information Technology   79.79
ACE                 Financials  102.91

Con il metodo `index.get_loc` si può sapere qual è il valore dell'indice (di posizione) associato a una specifica etichetta.

In [134]:
sp500_1.index.get_loc('MSFT')

302

In [135]:
i1 = sp500_1.index.get_loc('MMM')
i2 = sp500_1.index.get_loc('A')
i1, i2

(0, 10)

In [136]:
sp500_1.iloc[[i1,i2]]

             Sector   Price
Symbol
MMM     Industrials  141.14
A       Health Care   56.18

Ricerca scalare utilizzando `at[]` e `iat[]`:
- `at[]` effettua la ricerca sulla base delle etichette di riga e colonna specificate
- `iat[]` effettua la ricerca sulla base degli indici numerici di posizione di riga e colonna specificati

In [137]:
sp500_1.head()

                        Sector   Price
Symbol
MMM                Industrials  141.14
ABT                Health Care   39.60
ABBV               Health Care   53.95
ACN     Information Technology   79.79
ACE                 Financials  102.91

In [138]:
sp500_1.at['MMM', 'Sector']

'Industrials'

In [139]:
sp500_1.iat[0,1]

141.14

C'è anche la possibilità di effettuare una selezione che comprenda soltanto le righe che soddisfano una determinata condizione booleana.

In [140]:
sp500_1[sp500_1.Price < 20]

                             Sector  Price
Symbol
AES                       Utilities  13.61
AA                        Materials  13.52
AVP                Consumer Staples  14.14
BAC                      Financials  14.72
BEAM         Consumer Discretionary   0.00
BSX                     Health Care  12.83
CVC          Consumer Discretionary  17.45
CLF                       Materials  16.34
DNR                          Energy  16.71
F            Consumer Discretionary  16.02
FTR     Telecommunications Services   5.81
GNW                      Financials  17.28
HCBK                     Financials   9.80
HBAN                     Financials   9.10
IPG          Consumer Discretionary  18.56
IGT          Consumer Discretionary  12.66
JBL          Information Technology  18.50
KEY                      Financials  13.37
LSI          Information Technology  11.14
NWSA         Consumer Discretionary  17.09
NVDA         Information Technology  18.49
BTU                          Energy  17.22
PBCT                     Financials  14.43
PHM          Consumer Discretionary  19.70
RF                       Financials  10.07
SLM                      Financials   8.82
SPLS         Consumer Discretionary  11.65
TE                        Utilities  17.06
WU           Information Technology  15.77
WIN     Telecommunications Services   9.38
XRX          Information Technology  12.06

Le ricerche poi possono diventare anche più dettagliate, combinando condizioni booleani e altre tipologie di selezione.

In [141]:
sp500_1[(sp500_1.Price < 20) & (sp500_1.Price > 10)][['Sector','Price']]

                        Sector  Price
Symbol
AES                  Utilities  13.61
AA                   Materials  13.52
AVP           Consumer Staples  14.14
BAC                 Financials  14.72
BSX                Health Care  12.83
CVC     Consumer Discretionary  17.45
CLF                  Materials  16.34
DNR                     Energy  16.71
F       Consumer Discretionary  16.02
GNW                 Financials  17.28
IPG     Consumer Discretionary  18.56
IGT     Consumer Discretionary  12.66
JBL     Information Technology  18.50
KEY                 Financials  13.37
LSI     Information Technology  11.14
NWSA    Consumer Discretionary  17.09
NVDA    Information Technology  18.49
BTU                     Energy  17.22
PBCT                Financials  14.43
PHM     Consumer Discretionary  19.70
RF                  Financials  10.07
SPLS    Consumer Discretionary  11.65
TE                   Utilities  17.06
WU      Information Technology  15.77
XRX     Information Technology  12.06

### Operazioni su DataFrame

Le operazioni aritmetiche che coinvolgono il DataFrame ed uno scalare vengono effettuate su tutte le celle del DataFrame.

In [142]:
np.random.seed(123456)

In [143]:
df = pd.DataFrame(np.random.randn(5,4), columns = ['A','B','C','D'])
df

          A         B         C         D
0  0.469112 -0.282863 -1.509059 -1.135632
1  1.212112 -0.173215  0.119209 -1.044236
2 -0.861849 -2.104569 -0.494929  1.071804
3  0.721555 -0.706771 -1.039575  0.271860
4 -0.424972  0.567020  0.276232 -1.087401

In [144]:
df*2 # ogni valore presente nelle celle del DataFrame viene moltiplicato per 2

          A         B         C         D
0  0.938225 -0.565727 -3.018117 -2.271265
1  2.424224 -0.346429  0.238417 -2.088472
2 -1.723698 -4.209138 -0.989859  2.143608
3  1.443110 -1.413542 -2.079150  0.543720
4 -0.849945  1.134041  0.552464 -2.174801

Si possono effettuare operazioni sul DataFrame a partire dai valori contenuti in una sua riga.

In [145]:
df - df.iloc[0] # ad ogni riga del DataFrame sottrai i valori contenuti nella prima riga (facendo corrispondere le celle)

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.743000  0.109649  1.628267  0.091396
2 -1.330961 -1.821706  1.014129  2.207436
3  0.252443 -0.423908  0.469484  1.407492
4 -0.894085  0.849884  1.785291  0.048232

Nel caso in cui si voglia effettuare operazioni a partire dai valori contenuti in una porzione del DataFrame, è possibile creare un nuovo DataFrame che sia un "sotto-dataframe" di quello originale: per farlo, effettuiamo la selezione delle righe e colonne di interesse mediante l'operatore [].

In [213]:
subframe = df[1:4][['B','C']]
subframe

          B         C
1 -0.173215  0.119209
2 -2.104569 -0.494929
3 -0.706771 -1.039575

In [214]:
df - subframe # l'operazione viene effettuata solo dove ci sono valori da sottrarre, altrimenti rerstituisce NaN

    A    B    C   D
0 NaN  NaN  NaN NaN
1 NaN  0.0  0.0 NaN
2 NaN  0.0  0.0 NaN
3 NaN  0.0  0.0 NaN
4 NaN  NaN  NaN NaN

__NB__: il DataFrame `df` ha dimensioni 5x4, mentre il DataFrame `subframe` ha dimensioni 3x2; questo implica che per alcune celle di `df` non è presente il corrispondente valore di `subframe` da sottrarre, quindi il risultato è un DataFrame 5x4 in cui le celle dove non è stato possibile effettuare l'operazione contengono NaN (Not a Number).

Si possono anche effettuare operazioni che coinvolgono intere colonne.

In [148]:
a_col = df['A']

In [215]:
df.sub(a_col, axis=0) # sottrae il contenuto della colonna 'A' a tutte le altre colonne del DataFrame

     A         B         C         D
0  0.0 -0.751976 -1.978171 -1.604745
1  0.0 -1.385327 -1.092903 -2.256348
2  0.0 -1.242720  0.366920  1.933653
3  0.0 -1.428326 -1.761130 -0.449695
4  0.0  0.991993  0.701204 -0.662428

__NB__: il parametro `axis` consente di decidere lungo quale asse eseguire l'operazione: axis=0 significa "esegui l'operazione lungo l'asse delle righe", mentre axis=1 significa "esegui l'operazione lungo l'asse delle colonne". <br>
__PER CAPIRE__: con axis=0 agisco sulle colonne, con axis=1 agisco sulle righe.

### Reindicizzazione
La reindicizzazione fa tre cose:
- riordina i dati per corrispondere a un insieme di etichette
- inserisce NaN dove per una etichetta mancano dati
- inserisce NaN dove mancano alcuni dati

In [150]:
np.random.seed(1)
s = pd.Series(np.random.randn(5))
s

0    1.624345
1   -0.611756
2   -0.528172
3   -1.072969
4    0.865408
dtype: float64

In [151]:
s.index = ['a','b','c','d','e']
s

a    1.624345
b   -0.611756
c   -0.528172
d   -1.072969
e    0.865408
dtype: float64

In [152]:
s = pd.Series(np.random.randn(5))
s

0   -2.301539
1    1.744812
2   -0.761207
3    0.319039
4   -0.249370
dtype: float64

In [153]:
s.index = ['a', 'b', 'c', 'd', 'e']

In [154]:
s

a   -2.301539
b    1.744812
c   -0.761207
d    0.319039
e   -0.249370
dtype: float64

Con il metodo .reindex() si può creare una nuova serie di lunghezza diversa. Se non ci sono valori per un certo indice si ottiene NaN

In [155]:
s2 = s.reindex(['a','c','e','g'])
s2

a   -2.301539
c   -0.761207
e   -0.249370
g         NaN
dtype: float64

In [156]:
s2['a']

-2.3015386968802827

In [157]:
s1 = pd.Series([0,1,2], index = [0,1,2])
s2 = pd.Series([3,4,5], index = ['0','1','2'])
s1+s2
# non unifica gli indici perché i primi sono numeri interi e i secondi stringhe

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

con il metodo .astype() si può modificare il tipo di valore

In [158]:
s2.index = s2.index.values.astype(int)
s1+s2

0    3
1    5
2    7
dtype: int64

### Reindicizzare e inserire valori mancanti

In [159]:
s2 = s.copy()
s2.reindex(['a', 'f'], fill_value = 0)

a   -2.301539
f    0.000000
dtype: float64

L'inserimento di valori mancanti verrà trattato meglio vedendo le serie temporali

In [160]:
s3 = pd.Series(['red', 'green', 'blue'], index = [0, 3, 5])
s3

0      red
3    green
5     blue
dtype: object

forward e backword fill

In [161]:
s3.reindex(np.arange(0,7), method = 'ffill')

0      red
1      red
2      red
3    green
4    green
5     blue
6     blue
dtype: object

In [162]:
s3.reindex(np.arange(0,7), method = 'bfill')

0      red
1    green
2    green
3    green
4     blue
5     blue
6      NaN
dtype: object

### Riorganizzare e aggregare i dati
######  pag. 45 - 72

In [163]:
import pandas as pd
import numpy as np
import datetime
import matplotlib.pyplot as plt
%matplotlib inline

In [164]:
import yfinance as yf

In [165]:
start = datetime.datetime(2012, 1, 1)
end = datetime.datetime(2012, 12, 30)

In [166]:
msft = yf.download('MSFT', start, end)
aapl = yf.download('AAPL', start, end)

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [167]:
msft.to_csv("msft.csv")
aapl.to_csv("aapl.csv")

In [168]:
msft.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2012-01-03  26.549999  26.959999  26.389999  26.770000  21.238752  64731500
2012-01-04  26.820000  27.469999  26.780001  27.400000  21.738583  80516100
2012-01-05  27.379999  27.730000  27.290001  27.680000  21.960728  56081400
2012-01-06  27.530001  28.190001  27.530001  28.110001  22.301882  99455500
2012-01-09  28.049999  28.100000  27.719999  27.740000  22.008331  59706800

In [169]:
msft.tail()

                 Open       High        Low      Close  Adj Close    Volume
Date
2012-12-21  27.450001  27.490000  27.000000  27.450001  22.394157  98776500
2012-12-24  27.200001  27.250000  27.000000  27.059999  22.075996  20842400
2012-12-26  27.030001  27.200001  26.700001  26.860001  21.912830  31631100
2012-12-27  26.889999  27.090000  26.570000  26.959999  21.994410  39394000
2012-12-28  26.709999  26.900000  26.549999  26.549999  21.659929  28239900

In [170]:
msft = pd.read_csv("msft.csv", index_col = 0, parse_dates = True)
aapl = pd.read_csv("aapl.csv", index_col = 0, parse_dates = True)

In [171]:
msft[:3]

                 Open       High        Low  Close  Adj Close    Volume
Date
2012-01-03  26.549999  26.959999  26.389999  26.77  21.238752  64731500
2012-01-04  26.820000  27.469999  26.780001  27.40  21.738583  80516100
2012-01-05  27.379999  27.730000  27.290001  27.68  21.960728  56081400

In [172]:
aapl[:3]

                 Open       High        Low      Close  Adj Close     Volume
Date
2012-01-03  14.621429  14.732143  14.607143  14.686786  12.433825  302220800
2012-01-04  14.642857  14.810000  14.617143  14.765714  12.500644  260022000
2012-01-05  14.819643  14.948214  14.738214  14.929643  12.639430  271269600

#### Concatenare i DF

In [173]:
msftA01 = msft.loc['2012-01'][['Adj Close']]
msftA02 = msft.loc['2012-02'][['Adj Close']]

In [174]:
msftA01[:3]

            Adj Close
Date
2012-01-03  21.238752
2012-01-04  21.738583
2012-01-05  21.960728

In [175]:
msftA02[:3]

            Adj Close
Date
2012-02-01  23.714092
2012-02-02  23.761698
2012-02-03  23.991776

concateniamo due df con indici diversi limitandoci alle prime 3 righe

In [176]:
pd.concat([msftA01.head(3),msftA02.head(3)])

            Adj Close
Date
2012-01-03  21.238752
2012-01-04  21.738583
2012-01-05  21.960728
2012-02-01  23.714092
2012-02-02  23.761698
2012-02-03  23.991776

concateniamo due df con gli stessi indici

In [177]:
aaplA01 = aapl.loc['2012-01'][['Adj Close']]
withDups = pd.concat([msftA01[:3], aaplA01[:3]])
withDups

            Adj Close
Date
2012-01-03  21.238752
2012-01-04  21.738583
2012-01-05  21.960728
2012-01-03  12.433825
2012-01-04  12.500644
2012-01-05  12.639430

In [178]:
withDups.loc['2012-01-03']

            Adj Close
Date
2012-01-03  21.238752
2012-01-03  12.433825

con questa concatenazione abbiamo perso un'informazione, non sappiamo più a quale società si riferiscono i prezzi.

Per risolvere il problema utilizziamo il MultiIndex

In [179]:
closes = pd.concat([msftA01[:3], aaplA01[:3]], keys = ['MSFT','AAPL'])

In [180]:
closes

                 Adj Close
     Date
MSFT 2012-01-03  21.238752
     2012-01-04  21.738583
     2012-01-05  21.960728
AAPL 2012-01-03  12.433825
     2012-01-04  12.500644
     2012-01-05  12.639430

In [181]:
closes.loc['MSFT'][:3]

            Adj Close
Date
2012-01-03  21.238752
2012-01-04  21.738583
2012-01-05  21.960728

concatenazione su più colonne

In [182]:
msftAV = msft[['Adj Close','Volume']]
aaplAV = aapl[['Adj Close', 'Volume']]
pd.concat([msftAV,aaplAV])

            Adj Close     Volume
Date
2012-01-03  21.238752   64731500
2012-01-04  21.738583   80516100
2012-01-05  21.960728   56081400
2012-01-06  22.301882   99455500
2012-01-09  22.008331   59706800
...               ...        ...
2012-12-21  15.841752  596268400
2012-12-24  15.867363  175753200
2012-12-26  15.648655  302436400
2012-12-27  15.711494  455120400
2012-12-28  15.544634  354278400

[498 rows x 2 columns]

i due df non devono avere necessariamente le stesse colonne

In [183]:
aaplA = aapl[['Adj Close']]
pd.concat([msftAV, aaplA])

            Adj Close      Volume
Date
2012-01-03  21.238752  64731500.0
2012-01-04  21.738583  80516100.0
2012-01-05  21.960728  56081400.0
2012-01-06  22.301882  99455500.0
2012-01-09  22.008331  59706800.0
...               ...         ...
2012-12-21  15.841752         NaN
2012-12-24  15.867363         NaN
2012-12-26  15.648655         NaN
2012-12-27  15.711494         NaN
2012-12-28  15.544634         NaN

[498 rows x 2 columns]

se vogliamo che il risultato sia solo ciò che i due df hanno in comune utilizziamo una funzione simile a quella di SQL inner join

In [184]:
pd.concat([msftAV, aaplA], join='inner')

            Adj Close
Date
2012-01-03  21.238752
2012-01-04  21.738583
2012-01-05  21.960728
2012-01-06  22.301882
2012-01-09  22.008331
...               ...
2012-12-21  15.841752
2012-12-24  15.867363
2012-12-26  15.648655
2012-12-27  15.711494
2012-12-28  15.544634

[498 rows x 1 columns]

modificando l'asse lungo il quale avviene il concatenamento possiamo vedere le colonne affiancate

In [185]:
msftA = msft[['Adj Close']]
closes = pd.concat([msftA, aaplA], axis = 1)
closes[:3]

            Adj Close  Adj Close
Date
2012-01-03  21.238752  12.433825
2012-01-04  21.738583  12.500644
2012-01-05  21.960728  12.639430

In [186]:
closes = pd.concat([msftA, aaplA], axis = 1, keys = ['MSFT','AAPL'])
closes[:3]

                 MSFT       AAPL
            Adj Close  Adj Close
Date
2012-01-03  21.238752  12.433825
2012-01-04  21.738583  12.500644
2012-01-05  21.960728  12.639430

In [187]:
pd.concat([msftAV[:5], aaplAV[:3]], axis = 1, keys = ['MSFT','AAPL'])

                 MSFT                 AAPL
            Adj Close    Volume  Adj Close       Volume
Date
2012-01-03  21.238752  64731500  12.433825  302220800.0
2012-01-04  21.738583  80516100  12.500644  260022000.0
2012-01-05  21.960728  56081400  12.639430  271269600.0
2012-01-06  22.301882  99455500        NaN          NaN
2012-01-09  22.008331  59706800        NaN          NaN

se vogliamo solo i valori che le due serie hanno in comune ("intersezione") usiamo il parametro 'join' (pag. 55)

In [188]:
pd.concat([msftAV[:5], aaplAV[:3]], axis = 1, join = 'inner', keys = ['MSFT','AAPL'])

                 MSFT                 AAPL
            Adj Close    Volume  Adj Close     Volume
Date
2012-01-03  21.238752  64731500  12.433825  302220800
2012-01-04  21.738583  80516100  12.500644  260022000
2012-01-05  21.960728  56081400  12.639430  271269600

Si può anche concatenare le due serie ignorando l'indice

In [189]:
pd.concat([msftAV[:3], aaplAV[:3]], ignore_index = True)

   Adj Close     Volume
0  21.238752   64731500
1  21.738583   80516100
2  21.960728   56081400
3  12.433825  302220800
4  12.500644  260022000
5  12.639430  271269600

#### Fondere i DF pag. 56

La funzione pd.merge() combina i dati basandosi sui valori di una colonna invece che sull'indice

In [190]:
msftAR = msftA.reset_index()
msftAR

          Date  Adj Close
0   2012-01-03  21.238752
1   2012-01-04  21.738583
2   2012-01-05  21.960728
3   2012-01-06  22.301882
4   2012-01-09  22.008331
..         ...        ...
244 2012-12-21  22.394157
245 2012-12-24  22.075996
246 2012-12-26  21.912830
247 2012-12-27  21.994410
248 2012-12-28  21.659929

[249 rows x 2 columns]

In [191]:
msftVR = msft[['Volume']].reset_index()
msftVR

          Date    Volume
0   2012-01-03  64731500
1   2012-01-04  80516100
2   2012-01-05  56081400
3   2012-01-06  99455500
4   2012-01-09  59706800
..         ...       ...
244 2012-12-21  98776500
245 2012-12-24  20842400
246 2012-12-26  31631100
247 2012-12-27  39394000
248 2012-12-28  28239900

[249 rows x 2 columns]

In [192]:
msftCVR = pd.merge(msftAR, msftVR)
msftCVR.head()

        Date  Adj Close    Volume
0 2012-01-03  21.238752  64731500
1 2012-01-04  21.738583  80516100
2 2012-01-05  21.960728  56081400
3 2012-01-06  22.301882  99455500
4 2012-01-09  22.008331  59706800

Diversi tipi di "join":
- left - usa le chiavi del df di sinistra (eq SQL LEFT-OUTER JOIN)
- right - usa le chiavi del df a destra (eq SQL RISHT-OUTER JOIN)
- outer - usa l'union delle chiavi dei due df (eq SQL FULL OUTER JOIN)
- inner - usa l'intersezione delle chiavi dei due df (eq SQL INNER JOIN)

In [193]:
msftAR0_5 = msftAR[0:5]
msftAR0_5

        Date  Adj Close
0 2012-01-03  21.238752
1 2012-01-04  21.738583
2 2012-01-05  21.960728
3 2012-01-06  22.301882
4 2012-01-09  22.008331

In [194]:
msftVR2_4 = msftVR[2:4]
msftVR2_4

        Date    Volume
2 2012-01-05  56081400
3 2012-01-06  99455500

In [195]:
pd.merge(msftAR0_5, msftVR2_4)

        Date  Adj Close    Volume
0 2012-01-05  21.960728  56081400
1 2012-01-06  22.301882  99455500

In [196]:
pd.merge(msftAR0_5, msftVR2_4, how = 'outer')

        Date  Adj Close      Volume
0 2012-01-03  21.238752         NaN
1 2012-01-04  21.738583         NaN
2 2012-01-05  21.960728  56081400.0
3 2012-01-06  22.301882  99455500.0
4 2012-01-09  22.008331         NaN

### Pivoting

#### pag. 59

In [197]:
msft.insert(0, 'Symbol', 'MSFT')
msft

,Symbol,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,,
2012-01-03,MSFT,26.549999,26.959999,26.389999,26.770000,21.238752,64731500
2012-01-04,MSFT,26.820000,27.469999,26.780001,27.400000,21.738583,80516100
2012-01-05,MSFT,27.379999,27.730000,27.290001,27.680000,21.960728,56081400
2012-01-06,MSFT,27.530001,28.190001,27.530001,28.110001,22.301882,99455500
2012-01-09,MSFT,28.049999,28.100000,27.719999,27.740000,22.008331,59706800
...,...,...,...,...,...,...,...
2012-12-21,MSFT,27.450001,27.490000,27.000000,27.450001,22.394157,98776500
2012-12-24,MSFT,27.200001,27.250000,27.000000,27.059999,22.075996,20842400
2012-12-26,MSFT,27.030001,27.200001,26.700001,26.860001,21.912830,31631100
2012-12-27,MSFT,26.889999,27.090000,26.570000,26.959999,21.994410,39394000
2012-12-28,MSFT,26.709999,26.900000,26.549999,26.549999,21.659929,28239900

In [198]:
aapl.insert(0, 'Symbol', 'AAPL')
aapl

,Symbol,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,,
2012-01-03,AAPL,14.621429,14.732143,14.607143,14.686786,12.433825,302220800
2012-01-04,AAPL,14.642857,14.810000,14.617143,14.765714,12.500644,260022000
2012-01-05,AAPL,14.819643,14.948214,14.738214,14.929643,12.639430,271269600
2012-01-06,AAPL,14.991786,15.098214,14.972143,15.085714,12.771559,318292800
2012-01-09,AAPL,15.196429,15.276786,15.048214,15.061786,12.751298,394024400
...,...,...,...,...,...,...,...
2012-12-21,AAPL,18.302500,18.559643,18.222857,18.547501,15.841752,596268400
2012-12-24,AAPL,18.583929,18.723213,18.525356,18.577499,15.867363,175753200
2012-12-26,AAPL,18.535713,18.552143,18.254286,18.321428,15.648655,302436400
2012-12-27,AAPL,18.340714,18.437500,18.023571,18.395000,15.711494,455120400
2012-12-28,AAPL,18.224644,18.374287,18.147142,18.199642,15.544634,354278400

In [199]:
combined = pd.concat([msft, aapl]).sort_index()
s4p = combined.reset_index()
s4p.head()

,Date,Symbol,Open,High,Low,Close,Adj Close,Volume
0,2012-01-03,MSFT,26.549999,26.959999,26.389999,26.770000,21.238752,64731500
1,2012-01-03,AAPL,14.621429,14.732143,14.607143,14.686786,12.433825,302220800
2,2012-01-04,MSFT,26.820000,27.469999,26.780001,27.400000,21.738583,80516100
3,2012-01-04,AAPL,14.642857,14.810000,14.617143,14.765714,12.500644,260022000
4,2012-01-05,MSFT,27.379999,27.730000,27.290001,27.680000,21.960728,56081400

Vogliamo creare un nuovo DF nel quale AAPL e MSFT sia il titolo di due colonne con a fianco i prezzi di chiusura

In [200]:
closes= s4p.pivot(index = 'Date', columns = 'Symbol', values = 'Adj Close')
closes.head()

Symbol           AAPL       MSFT
Date
2012-01-03  12.433825  21.238752
2012-01-04  12.500644  21.738583
2012-01-05  12.639430  21.960728
2012-01-06  12.771559  22.301882
2012-01-09  12.751298  22.008331

### Stacking e unstacking
- stack smonta la pivot
- unstack torna indietro

In [201]:
stackedCloses = closes.stack()
stackedCloses

Date        Symbol
2012-01-03  AAPL      12.433825
            MSFT      21.238752
2012-01-04  AAPL      12.500644
            MSFT      21.738583
2012-01-05  AAPL      12.639430
                        ...
2012-12-26  MSFT      21.912830
2012-12-27  AAPL      15.711494
            MSFT      21.994410
2012-12-28  AAPL      15.544634
            MSFT      21.659929
Length: 498, dtype: float64

In [202]:
stackedCloses.loc['2012-01-03','AAPL']

12.433825492858888

In [203]:
stackedCloses.loc['2012-08-31']

Symbol
AAPL    20.200352
MSFT    24.938536
dtype: float64

In [204]:
stackedCloses.loc[:,'MSFT']

Date
2012-01-03    21.238752
2012-01-04    21.738583
2012-01-05    21.960728
2012-01-06    22.301882
2012-01-09    22.008331
                ...
2012-12-21    22.394157
2012-12-24    22.075996
2012-12-26    21.912830
2012-12-27    21.994410
2012-12-28    21.659929
Length: 249, dtype: float64

In [205]:
unstackedCloses = stackedCloses.unstack()
unstackedCloses.head()

Symbol           AAPL       MSFT
Date
2012-01-03  12.433825  21.238752
2012-01-04  12.500644  21.738583
2012-01-05  12.639430  21.960728
2012-01-06  12.771559  22.301882
2012-01-09  12.751298  22.008331

### Melting

Trasforma un df in un altro df dove ogni riga è una combinazione di id e variabile

In [206]:
melted = pd.melt(s4p, id_vars = ['Date', 'Symbol'])
melted.head()

        Date Symbol variable      value
0 2012-01-03   MSFT     Open  26.549999
1 2012-01-03   AAPL     Open  14.621429
2 2012-01-04   MSFT     Open  26.820000
3 2012-01-04   AAPL     Open  14.642857
4 2012-01-05   MSFT     Open  27.379999

In [207]:
melted[(melted.Date == '2012-01-03') & (melted.Symbol == 'MSFT')]

           Date Symbol   variable         value
0    2012-01-03   MSFT       Open  2.655000e+01
498  2012-01-03   MSFT       High  2.696000e+01
996  2012-01-03   MSFT        Low  2.639000e+01
1494 2012-01-03   MSFT      Close  2.677000e+01
1992 2012-01-03   MSFT  Adj Close  2.123875e+01
2490 2012-01-03   MSFT     Volume  6.473150e+07

### Split - Combine - Apply

#### pag. 63

In [208]:
s4g = combined[['Symbol', 'Adj Close']].reset_index()
s4g

          Date Symbol  Adj Close
0   2012-01-03   MSFT  21.238752
1   2012-01-03   AAPL  12.433825
2   2012-01-04   MSFT  21.738583
3   2012-01-04   AAPL  12.500644
4   2012-01-05   MSFT  21.960728
..         ...    ...        ...
493 2012-12-26   MSFT  21.912830
494 2012-12-27   AAPL  15.711494
495 2012-12-27   MSFT  21.994410
496 2012-12-28   MSFT  21.659929
497 2012-12-28   AAPL  15.544634

[498 rows x 3 columns]

In [209]:
s4g.insert(1,'Year',pd.DatetimeIndex(s4g['Date']).year)

In [210]:
s4g.insert(2,'Month',pd.DatetimeIndex(s4g['Date']).month)
s4g

          Date  Year  Month Symbol  Adj Close
0   2012-01-03  2012      1   MSFT  21.238752
1   2012-01-03  2012      1   AAPL  12.433825
2   2012-01-04  2012      1   MSFT  21.738583
3   2012-01-04  2012      1   AAPL  12.500644
4   2012-01-05  2012      1   MSFT  21.960728
..         ...   ...    ...    ...        ...
493 2012-12-26  2012     12   MSFT  21.912830
494 2012-12-27  2012     12   AAPL  15.711494
495 2012-12-27  2012     12   MSFT  21.994410
496 2012-12-28  2012     12   MSFT  21.659929
497 2012-12-28  2012     12   AAPL  15.544634

[498 rows x 5 columns]

In [211]:
s4g.groupby('Symbol')